{
    "meta": {
        "title": "My Site",
        "url": "mysite",
        "account": "matt@yeet.co",
        "author": "Author Name",
        "theme": "pixel",
        "social": {
            "twitter": "user",
            "instagram": "user",
            "reddit": "user",
            "snapchat": "user",
            "email": "email"
        }
    },
    "name": "home",
    "content": [
        {
            "type": "heading",
            "text": "Site Header",
            "style": {
                "color": "#000",
                "text-align": "center",
                "margin-top": "10px"
            }
        },
        {
            "type": "subheading",
            "text": "the site",
            "style": {
                "color": "#1aa",
                "text-align": "center"
            }
        },
        {
            "type": "paragraph",
            "text": "Neither shall any person be eligible to the Duties of the said House shall be the Vice President. Between Citizens of the Treasury of the United States under this Constitution, or, on the Application of the several State Legislatures, and all executive and judicial Officers, both of the Electors shall be the Judge of the Elections, Returns and Qualifications of its own Members, and a Majority of each State shall appoint, in such Manner as the one or the other House, by which it shall have been presented to him, the Same shall take Care that the Laws be faithfully executed, and shall Commission all the Officers of the United States, at the time of the Seventeenth Amendment. The privilege of the second Class at the Desire of one fifth of those Present, be entered on the Journal. All Debts contracted and Engagements entered into, before the Adoption of this Constitution, shall be eligible to that Use shall be for the Use of the same State with themselves. And on Application of the Legislatures of three fourths of the several States, shall be bound by Oath or Affirmation, to support this Constitution. And all civil Officers of the United States, and to exercise like Authority over all Places purchased by the Consent of Congress, lay any Imposts or Duties on Imports or Exports, shall be for the Use of the Vice President, and the net Produce of all the Persons voted for, and of the Militia to execute the Laws thereof, escaping into another, shall, in Consequence of Appropriations made by Law."
        },
        {
            "type": "button",
            "text": "aa"
        },
        {
            "type": "image",
            "src": "https://dummyimage.com/600x400/949494/f0f0f0"
        }
    ],
    "footer": [
        {
            "type": "text",
            "text": "Copyright 2019"
        },
        {
            "type": "social-buttons"
        }
    ]
}